"""
    1。 制作一个可以在Windows上运行的程序，可以翻译鼠标选中的内容
    2。 制作一个简单的爬虫，自动抓取直播的评论区内容，并且实现文字转语音功能，自动回复
    3。 制作一个简单的网页
    4。 制作一个自己的博客网站
    5。 给自己发送邮件
    6。 爬虫以及数据可视化 (花)








        大家🈶️什么想做的内容可以直接打在评论区哦，
        看到了，你是windows还是mac呢。
        我的环境还没准备好，明天开始就会从头一步一步的教，从装环境开始。

        我现在这个环境是mac的，明天把，我准备一个windows的环境，我们从头开始。
        明天晚上8:00-11:00 ，到时候我叫你。 昨日星辰。
        没关系，到时候我会录播，到时候你来了再重新来一次装环境也是可以的
        没关系。
        你有什么不明白的地方，或者想实现的功能可以直接打在评论区，

        好的，没关系，慢慢来就好了。

        这只是执行命令的时候是和dos差不多，但是代码的话就不一样了。


"""