"""
    第一周   7月3号到7月8号

    编程是什么？
    代码是什么？
    python是什么？
    编程可以做什么？
    python可以实现什么，有哪些方面的应用？
    如何学习python，路线图？

    本直播主要是教女朋友学python。
    同时适合刚入门或者还没入门想学的。
    晚上9:30-11:00开始
    周一、二、三讲解python基础及练习，
    周四讲解关于编程的其他额外基础知识/分享AI相关技术
    周六进行总结
    --Notice:
    晚上讲解
        # 1。 环境的搭建(昨天已经完成，没有跟上的可以看后续发的视频)
        2。 编程思维
        3。 python学习路线图
        4。 (实践)制作一个最简单的网页

    ~~大家有什么问题或者想学的，想实现的功能可以
    打在评论区，或者私信我，我都会列到计划里面。

    第二周 7月10到7月18号
    1. 练习制作一个简单的网页，对上周学习的python的基础再加深印象。
    2. 制作一个在windows上运行的翻译软件，可以或者我们复制的内容，
        并且进行汉语-英语/英语-汉语的翻译。













"""


